while True:
  print("-------------------------")
  print("1. 2차 방정식의 인수분해")
  print("2. 구의 값 구하기")
  print("3. 뿔의 값 구하기")
  print("4. 기둥의 값 구하기")
  print("5. 종료")
  print("-------------------------")
  num = int(input("실행할 기능의 번호를 입력하시오 :"))
  
  if num == 1:
      print("1. 2차 방정식의 인수분해")
      print("~~~~~~~~~~~~~~~~~")
      print("~~~~~~~~~~~~~~~~~")
        
  elif num == 2:
      print("2. 구의 값 구하기")
      print("~~~~~~~~~~~~~~~~~")
      print("~~~~~~~~~~~~~~~~~")
    
  elif num == 3:
      print("3. 뿔의 값 구하기")
      print("~~~~~~~~~~~~~~~~~")
      print("~~~~~~~~~~~~~~~~~")

  elif num == 4:
      print("4. 기둥의 값 구하기")
      print("~~~~~~~~~~~~~~~~~")
      print("~~~~~~~~~~~~~~~~~")
  elif num == 5:
      break